"""
ENG:
Board game: Spyfall
Script for random choice place from list of locations. Location exported in file 'output.txt'

RU:
Настольная игра: Находка для шпиона.
Скрипт для рандомного выбора локации из списка. Локация выводится в файл 'output.txt'.
"""

import random
import sys
file = open('output.txt', 'a')
sys.stdout = file
list_of_locations = [ 
"База террористов",
"Банк",
"Больница",
"Воинская часть",
"Войско крестоносцев",
"Казино",
"Киностудия",
"Корпоративная вечеринк",
"Овощебаза",
"Океанский лайнер",
"Орбитальная станция",
"Отель",
"Партизанский отряд",
"Пассажирский поезд",
"Пиратский корабль",
"Пляж",
"Подводная лодка",
"Полицейский участок",
"Полярная станция",
"Посольство",
"Ресторан",
"Самолет",
"Спа-салон",
"Станция техобслуживания",
"Супермаркет",
"Театр",
"Университет",
"Церковь",
"Цирк-шапито",
"Школа"
]
random_choice = random.choice(list_of_locations);
print("Локация: " + random_choice);

file.close()